project04/app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "title", "author", "updated_at", "date", "description") VALUES('2011-02-06 20:53:34', 'Lorem Ipsum', 'Robert Frost', '2011-02-06 20:53:34', '', 'What he said')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2011-02-08 10:50:49', "description" = 'What he said asldkjflkdj' WHERE "id" = 1
---
  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(params[:article])