project06/app/controllers/games_controller.rb

  def index
    @num_games = Game.count
	@games = Game.paginate(:page => params[:page])
---
SELECT count(*) AS count_all FROM "games"
SELECT * FROM "games" LIMIT 10 OFFSET 0