project06/app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      flash[:notice] = "Logged in successfully."
      if User.find_by_username(@user_session.username).roles.name == "admin"
---
SELECT "users".id FROM "users" WHERE (LOWER("users"."username") = 'administrator') LIMIT 1