project06/app/controllers/member/users_controller.rb

INSERT INTO "users" ("created_at", "photo_file_size", "crypted_password", "updated_at", "photo_file_name", "username", "photo_content_type", "lastname", "photo_updated_at", "password_salt", "firstname", "persistence_token", "roles_id", "email") VALUES('2011-03-11 23:23:41', NULL, '529cc331867f727d3ba1c243a6d5abd61fbe57fd3af7c0bf3c063d03f64d7691416043e865af6ffedb74859d080a5e5f1df51f271bbabd823f8991051d6d6b30', '2011-03-11 23:23:41', NULL, 'joemarti', NULL, 'Martinez', NULL, 'ccobQIdShFBzg588C7c6', 'Joe', '7c9ebbb953e085172e7208b5ff74ac3f298bc5f90882cc00dfe363482d214fd5480b4f45816004ea0aa9b0d47f73611c46ac3d51525dfb7f036daefdac4f3c08', NULL, 'joemar44@aol.com')
---
  def create
	@user = User.new(params[:user])
	if @user.save